blog/2013-05-24-compiling.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Compiling R from Source with OpenMP, Accelerate and MKL in OS X - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Compiling R from Source in OS X I set out to find out whether I could speed up R by compiling it from source and: using Apple´s Accelerate Framework &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		<a class="facebook" href="http://www.facebook.com/ronert.obst" title="Facebook">Facebook</a>
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Compiling R From Source With OpenMP, Accelerate and MKL in OS X</h2>
	<div class="entry-content"><div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Compiling R from Source in OS X</h2>
<div class="outline-text-2" id="text-1">

<p>I set out to find out whether I could speed up R by compiling it from source and:
</p><ul>
<li>using Apple´s <a href="https://developer.apple.com/performance/accelerateframework.html">Accelerate Framework</a>
</li>
<li>enabling <a href="http://openmp.org/wp/">OpenMP</a> (which is disabled under OS X and Windows by default, but enabled under Linux)
</li>
<li>using Intel´s <a href="http://software.intel.com/en-us/intel-mkl">Intel´s Math Kernel Library</a>
</li>
</ul>

<p>I also wanted to know how an implicit parallel library, like OpenMP,
performs within explicit parallelism, e.g. calls from the <code>parallel</code>
package.
</p>
<p>
So I compiled 6 different versions of R 3.01 on OS X and tested them
for speed against the OS X .pkg from CRAN. I used gcc 4.8 (not the gcc
4.2 from Apple), which you can download from <a href="http://hpc.sourceforge.net/">here</a>. For MKL, I used
both the GNU (gcc, gfortran) and the Intel compilers (icc,
ifortran). The 6 versions and their <code>configure</code> settings are:
</p>
<ol>
<li><a href="https://gist.github.com/ronert/5645530">R 3.01 compiled with Apple´s Accelerate framework</a>
</li>
<li><a href="https://gist.github.com/ronert/5645541">R 3.01 compiled with OpenMP enabled</a>
</li>
<li><a href="https://gist.github.com/ronert/5645561">R 3.01 compiled with gcc and gfortran using Intel MKL (sequential)</a>
</li>
<li><a href="https://gist.github.com/ronert/5645576">R 3.01 compiled with icc and ifortran using Intel MKL (sequential)</a>
</li>
<li><a href="https://gist.github.com/ronert/5645598">R 3.01 compiled with gcc and gfortran using Intel MKL (threaded)</a>
</li>
<li><a href="#Https-gist.github.com-ronert-5645607">R 3.01 compiled with icc and ifortran using Intel MKL (threaded)</a>
</li>
</ol>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Benchmarks</h2>
<div class="outline-text-2" id="text-2">

<p>To measure the speed of the 7 Versions of R I now had (6 compiled, 1
.pkg from CRAN), I used Simon Urbanek´s <a href="http://r.research.att.com/benchmarks/R-benchmark-25.R">R Benchmark 2.5</a>. I let it
execute serially for 8 runs, and then in parallel with 4 cores and
2 runs each (so also 8 in total). Additionally, I let each version of
R carry out a large matrix multiplication (10000 rows and 5000
columns). Click <a href="https://gist.github.com/ronert/5645691">here to view the benchmark script.</a> I ran the tests on
an Intel Core i5 clocked at 2.9 GHz with 16 GB RAM.
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Results</h2>
<div class="outline-text-2" id="text-3">

<p>Elapsed time in seconds for various R builds and benchmarks under OS X:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption />
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">R 3.01</th><th scope="col" class="right">Bench. 2.5</th><th scope="col" class="left">Bench. 2.5 mclapply</th><th scope="col" class="right">Matrix mult.</th></tr>
</thead>
<tbody>
<tr><td class="left">CRAN OS X .pkg</td><td class="right">421.839</td><td class="left">154.851</td><td class="right">406.383</td></tr>
<tr><td class="left">Accelerate with gcc</td><td class="right">107.624</td><td class="left">NA</td><td class="right">15.730</td></tr>
<tr><td class="left">OpenMP enabled with gcc</td><td class="right">108.003</td><td class="left">NA</td><td class="right">14.530</td></tr>
<tr><td class="left">MKL sequential compiled with gcc</td><td class="right">107.513</td><td class="left">NA</td><td class="right">15.449</td></tr>
<tr><td class="left">MKL sequential compiled with icc</td><td class="right">133.528</td><td class="left">NA</td><td class="right">15.197</td></tr>
<tr><td class="left">MKL threaded compiled with gcc</td><td class="right">111.821</td><td class="left">NA</td><td class="right">14.694</td></tr>
<tr><td class="left">MKL threaded compiled with icc</td><td class="right">136.711</td><td class="left">NA</td><td class="right">15.033</td></tr>
</tbody>
</table>


<p>
So what do all the NAs mean? None of the R versions I compiled could
execute <code>mclapply()</code> without crashing. If anyone knows how to fix this,
please drop me a message. The benchmarks of the R versions that did
run were <i>much</i> faster though. The Matrix multiplication was on
average 2700% faster, and the more diversified R Benchmark was around
400% faster than stock R on OS X for the optimized
libraries. Nevertheless, if I cannot fix the crashes that occur with
the parallel library, I am going to stick with the stock R version
from CRAN. Any suggestions to improve the compiler options or tests to
add to the profiling script are very welcome.
</p></div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-05-24T12:47:00+02:00" pubdate data-updated="true">May 24<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/r/'>R</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	<a class="addthis_button_facebook_like" fb:like:layout="button_count"></a>
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>



<section id="comment">
    <h2 class="title">Comments</h2>
    <div id="disqus_thread" aria-live="polite"><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</section>
</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        // var disqus_developer = 1;
        var disqus_identifier = 'http://ronert-obst.com/blog/2013-05-24-compiling.html';
        var disqus_url = 'http://ronert-obst.com/blog/2013-05-24-compiling.html';
        var disqus_script = 'embed.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>